# -*- org-export-babel-evaluate: nil -*-
#+PROPERTY: header-args :eval never-export
#+PROPERTY: header-args:python :session Tensorflow 实现递归神经网络
#+PROPERTY: header-args:ipython :session Tensorflow 实现递归神经网络
# #+HTML_HEAD: <link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
# #+HTML_HEAD: <script src="https://hypothes.is/embed.js" async></script>
# #+HTML_HEAD: <script type="application/json" class="js-hypothesis-config">
# #+HTML_HEAD: <script src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
#+OPTIONS: html-link-use-abs-url:nil html-postamble:nil html-preamble:t
#+OPTIONS: H:3 num:t ^:nil _:nil tags:not-in-toc
#+TITLE: Tensorflow 实现递归神经网络
#+AUTHOR: yiddishkop
#+EMAIL: [[mailto:yiddishkop@163.com][yiddi's email]]
#+TAGS: {PKGIMPT(i) DATAVIEW(v) DATAPREP(p) GRAPHBUILD(b) GRAPHCOMPT(c)} LINAGAPI(a) PROBAPI(b) MATHFORM(f) MLALGO(m)


** 源代码
#+BEGIN_SRC ipython :tangle yes :session lec-5-RNN :exports code :async t :results raw drawer
  import tensorflow as tf
  from tensorflow.examples.tutorials.mnist import input_data

  # LOAD DATA
  mnist = input_data.read_data_sets("MNIST", one_hot=True)

  # GRAPH BUILDING
  # ==============
  # shape of input image: 28*28, feed one 'line' of an image to
  # input layer each time, so input layer has 28 neurons, so that
  # each image can be seen as a 28 length sequence of 28-D vectors.
  # Many to one RNN

  n_inputs = 28 # input one line, 28 scalar each line
  max_time = 28 # 28 lines totally
  lstm_size = 100 # number of unit of hidden layer
  n_classes = 10 # number of kinds of labels
  batch_size = 50 # size of each batch
  n_batch = mnist.train.num_examples // batch_size # number batches in each epoch

  x = tf.placeholder(tf.float32, [None, 784])
  y = tf.placeholder(tf.float32, [None, 10])

  # weights variable initialization
  weights = tf.Variable(tf.truncated_normal([lstm_size, n_classes], stddev=0.1))
  # biases variable initialization
  biases = tf.Variable(tf.constant(0.1, shape=[n_classes]))

  # RNN building helper function. Note that, RNN is designed for sequence
  # learning, so that each input must be a sequence of vectors(dimension of
  # vector is compatible with number of units of the RNN layer). Here each input
  # is a |max_time| length sequence of |n_inputs| dimensin vectors. As each image
  # is seen as a sequence of row pixels.
  def RNN(X, weights, biases):
      # inputs = [batch_size, max_time, n_inputs]
      inputs = tf.reshape(X, [-1, max_time, n_inputs])
      # define LSTM basic cell
      lstm_cell = tf.contrib.rnn.BasicLSTMCell(lstm_size)
      # final_state[0] is cell state, 这是下一次循环时 rnn layers LSTM cell 里存的值
      # final_state[1] is hidden state, 这是 rnn layer 的输出
      outputs, final_state = tf.nn.dynamic_rnn(lstm_cell, inputs, dtype=tf.float32)
      results = tf.nn.softmax(tf.matmul(final_state[1], weights) + biases)
      return results

  # RNN related operation node
  prediction = RNN(x, weights, biases)
  # loss fn
  cross_entropy = tf.reduce_mean(tf.nn.softmax_cross_entropy_with_logits_v2(logits=prediction, labels=y))
  # apply AdamOptimizer
  train_step = tf.train.AdamOptimizer(1e-4).minimize(cross_entropy)
  # store results in a boolean list
  correct_prediction = tf.equal(tf.argmax(y, 1), tf.argmax(prediction, 1))
  # compute accuracy
  accuracy = tf.reduce_mean(tf.cast(correct_prediction, tf.float32))
  # global initialization
  init= tf.global_variables_initializer()

  # GRAPH COMPUTATION
  # =================
  with tf.Session() as sess:
      sess.run(init)
      for epoch in range(6):
          for batch in range(n_batch):
              batch_xs, batch_ys = mnist.train.next_batch(batch_size)
              sess.run(train_step, feed_dict={x:batch_xs, y:batch_ys})

          acc = sess.run(accuracy, feed_dict={x:mnist.test.images, y:mnist.test.labels})
          print("Iter " + str(epoch) + ", Testing Accuracy= " + str(acc))
#+END_SRC

#+RESULTS:
:RESULTS:
# Out[4]:
:END:

